practicals/ps6/suzanne/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue tracer 0
);

regions
(
    // Set cell values
    // (does zerogradient on boundaries)
    boxToCell
    {
	box (0 0 0) (4 0.05 0.1);

        fieldValues
        (
            volScalarFieldValue tracer 1
        );
    }
);

// ************************************************************************* //
